romkatv/zsh-defer
ohmyzsh/ohmyzsh path:lib

ohmyzsh/ohmyzsh path:plugins/colored-man-pages

ohmyzsh/ohmyzsh path:plugins/git kind:defer

#ohmyzsh/ohmyzsh path:plugins/git-extras kind:defer

#ohmyzsh/ohmyzsh path:plugins/git-prompt kind:defer

ohmyzsh/ohmyzsh path:plugins/golang

ohmyzsh/ohmyzsh path:plugins/python kind:defer

ohmyzsh/ohmyzsh path:plugins/gh kind:defer

ohmyzsh/ohmyzsh path:plugins/alias-finder

# ohmyzsh/ohmyzsh path:plugins/podman

 
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/docker-machine

zsh-users/zsh-completions

ohmyzsh/ohmyzsh path:plugins/fzf

# ohmyzsh/ohmyzsh path:plugins/zsh-interactive-cd

romkatv/powerlevel10k

# suggests pkg to install if command not found
# ohmyzsh/ohmyzsh path:plugins/command-not-found

zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search kind:defer




