romkatv/zsh-defer
ohmyzsh/ohmyzsh path:lib

ohmyzsh/ohmyzsh path:plugins/git kind:defer # handy git aliases

ohmyzsh/ohmyzsh path:plugins/golang # go aliases and completions

ohmyzsh/ohmyzsh path:plugins/gh kind:defer # idem

ohmyzsh/ohmyzsh path:plugins/docker # idem
ohmyzsh/ohmyzsh path:plugins/docker-compose # idem

zsh-users/zsh-completions

ohmyzsh/ohmyzsh path:plugins/fzf

romkatv/powerlevel10k # prompt

zsh-users/zsh-autosuggestions kind:defer
zsh-users/zsh-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search kind:defer
